CastaliaInstitute/atelier-astrolabe/astrolabe185b/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=n
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
# TinyUSB owns the native USB peripheral for the Cyber CDC/MSC/NCM composite.
# Keep the ESP-IDF primary console off that peripheral to avoid enumeration
# conflicts; faculty175_usb.c switches the application console to TinyUSB CDC.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CDC is intentionally disabled in the MSC bring-up image.
# CONFIG_TINYUSB_CDC_ENABLED is not set
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Castalia Institute"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Astrolabe 185B Cyber"
CONFIG_TINYUSB_DESC_SERIAL_STRING="astrolabe185b-cyber"
CONFIG_TINYUSB_DESC_CDC_STRING="Astrolabe Console"
CONFIG_TINYUSB_DESC_MSC_STRING="Astrolabe SD Boot"
# NCM returns after the SD MSC path is proven.
CONFIG_TINYUSB_NET_MODE_NONE=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
CONFIG_LWIP_IPV4_NAPT_PORTMAP=y
CONFIG_LV_USE_QRCODE=y
# CONFIG_BT_ENABLED is not set
